const modalText = {
  adult: {
    title: 'Ви впевнені, що хочете видалити свій акаунт?',
    text: "Якщо ви видалите свій акаунт, з системи також видаляться акаунти всіх прив'язаних дітей-користувачів. Ви хочете видалити свій акаунт?",
  },
  kid: {
    title: 'Ви впевнені, що хочете видалити акаунт дитини?',
    text: 'Якщо ви видалите акаунт дитини, то вона не буде більше прив’язана до вас, а її акаунт повністю буде видалено з системи додатку! Ви точно хоче видалити акаунт цієї дитини?',
  },
};

export default modalText;
