import { styled } from 'nativewind';
import { BackButton, IntroductionText, TertiaryTitle } from '@/shared/ui';
import { ScrollView, View } from 'react-native';

const WrapperText = styled(ScrollView);

const PrivacyPolicy: React.FC = () => {
  return (
    <>
      <View>
        <BackButton classNames="top-4 left-0" />
        <TertiaryTitle
          children="Умови та політика конфіденційності"
          classNames="ml-10"
        />
      </View>
      <WrapperText className="mt-6">
        <IntroductionText>
          Політика Конфіденційності SafeKid Набирає чинності: 16 квітня 2024
          року Останнє оновлення: 16 квітня 2024 року Ласкаво просимо! У цій
          політиці конфіденційності пояснюється, як ми збираємо, використовуємо,
          зберігаємо, захищаємо та передаємо вашу особисту інформацію за
          допомогою наших служб. Важливо, щоб ви прочитали цю політику повністю,
          але ось короткий виклад, щоб почати: Ми дуже дбаємо про
          конфіденційність. Ми прагнемо створити додаток, який буде підвищувати
          ступінь безпеки вашої дитини та вашого спокою. Повага до
          конфіденційності користувачів є однією з ключових принципів нашого
          додатку і компаніх в цілому. Ми не передаємо вашої особистої
          інформації третім особам. Ми обмежуємо необхідну інформацію. Нам
          потрібна інформація, яка дозволить створити ваш обліковий запис,
          надавати та підтримувати наші послуги, виконувати наші зобов’язання
          перед нашими користувачами, а також та, яку ми можемо використати для
          майбутнього удосконалення додатку. Ми дбаємо про безпеку. Наша віддана
          команда наполегливо працює, щоб гарантувати безпечність нашого
          додатку. Ми даємо вам контроль. Ми надаємо вам можливість контролювати
          свою конфіденційність у SafeKid шляхом надання можливості обирати
          ім'я, яке ви надаєте своїй дитині (ви можете використати будь-який нік
          у момент, коли ви заповнюєте поле "Ім'я дитини" при додаванні акаунту
          дитини до свого акаунта або при редагуванні даних дитини в процесі
          використання додатку). SafeKid - Додаток для запобігання викрадення
          дітей чи завдання їм шкоди, який призначений розпізнати в оточенні
          дитини потенційно небезпечні фрази і повідомити про це батькам і самій
          дитині. Ми створили додаток SafeKid щоб підвищити рівень безпеки
          дитини, коли її батьки знаходяться не поряд та не мають змоги
          контролювати з ким дитина спілкується. Наш додаток дає можливість
          своєчасно реагувати на потенційно небезпечні ситуації на основі
          аналізу розмов, в яких бере участь дитина або які відбуваються поряд з
          нею шляхом розпізнання спеціальних тригерних фраз, список яких було
          створено за участю психологів. Список тригерних фраз містить
          потенційно небезпечні фрази, які може використовувати людина, яка
          спілкується з вашою дитиною з намірами ввести її в оману та викрасти
          чи нанести шкоду. Інформація, яку ми збираємо Ми збираємо певну
          інформацію, коли ви використовуєте SafeKid. Це включає інформацію, яку
          ви надаєте нам та інформацію, яку ми збираємо автоматично. Інформація,
          яку ви нам надаєте Інформація про обліковий запис. Коли ви створюєте
          обліковий запис у SafeKid , ви використовуєте адресу вашої електронної
          пошти та пароль, які ми зберігаємо для того, щоб ідентифікувати вас
          при вході до додатку. Також ми зберігаємо ім'я або псевдонім вашої
          дитини, яке ви обираєте для неї самі, коли додаєте дитину до вашого
          акаунту (це може бути вигадане ім'я або псевдонім, за яким ви можете
          ідентифікувати свою дитину, особливо коли у вас прив'язано декілька
          дітей до акаунта) для того, щоб зберігати та ідентифікувати звязок між
          вами та доданими до вашого акаунту дітьми. Інформація, яку ми збираємо
          автоматично Ми також автоматично збираємо інформацію, коли ви
          використовуєте SafeKid . Це включає: Інформація про ваш пристрій. Ми
          збираємо інформацію про пристрій, який ви використовуєте для доступу
          до додатку. Наприклад, це включає вашу IP-адресу, інформацію про
          операційну систему і інформацію про налаштування мікрофону і камери
          дитини/дітей, які прив'язані до вашого облікового запису. Інформація
          про ваші запити до служби підтримки. Ми збираємо питання, які ви
          ставите, коли не можете знайти відповідь у існуючих відповідях на
          часті запитання, а також відповіді на них. Інша інформація, яку ми
          збираємо автоматично. Ми збираємо інформацію про тригерні фрази, на
          які реагує додаток. Як ми використовуємо вашу інформацію Для виконання
          нашого з вами договору Для надання вам послуг. Ми використовуємо вашу
          інформацію, щоб надавати вам доступ до додатку та всіх його функцій.
          Щоб зв'язатися з вами. Ми використовуємо вашу інформацію, щоб
          зв’язатися з вами у зв’язку з вашим обліковим записом, наприклад, щоб
          ви мали змогу відновити пароль у разі необхідності. Ми також можемо
          використовувати вашу інформацію, щоб зв’язатися з вами щодо важливих
          змін у додатку чи політиці конфіденційності та надіслати вам
          інформацію про зміни у додатку. Забезпечувати обслуговування клієнтів.
          Ми використовуємо вашу інформацію, щоб відповісти на ваші запитання
          щодо наших продуктів і послуг, а також для дослідження помилок чи
          інших проблем. Для наших законних ділових інтересів Для удосконалення
          продукту. Ми використовуємо вашу інформацію для  внутрішнього аналізу
          та удосконалення нашого додатку та якості наданих послуг в
          майбутньому. Щоб зв'язатися з вами. Ми можемо використовувати вашу
          інформацію, щоб повідомляти вам про нові функції, доступні в додатку,
          або щоб попросити вас надіслати відгук про наш додаток. Як ми
          розкриваємо вашу інформацію Дотримуватись закону. Ми можемо розкрити
          інформацію у відповідь на запит на інформацію, якщо ми вважаємо, що
          розкриття вимагається законом, зокрема відповідно до вимог
          національної безпеки чи правоохоронних органів. Якщо це дозволено та
          можливо, ми спробуємо надати вам попереднє сповіщення, перш ніж
          розкривати вашу інформацію у відповідь на такий запит. Збереження
          даних Ми зберігаємо анонімізовану інформацію, доки не визначимо, що
          вона більше не потрібна для цілей обробки, для яких ми її збирали чи
          зберігаємо, або для дотримання законодавства. Коли актуальність
          зібраної інформації для нас вичерпана, ми безслідно видаляємо її з
          усіх баз даних та носіїв. Як ми захищаємо вашу інформацію Ми вживаємо
          ряд заходів, щоб захистити вашу інформацію. Уся інформація, що
          надсилається в наших службах, шифрується як під час передачі, так і
          під час зберігання. Як контролювати конфіденційність Анонімізація. Ви
          можете надавати дітям, яких прив'язуєте до свого акаунту просто ім'я
          або навіть псевдонім, що не дає ніякої змоги ідентифікувати вас чи
          дитину окрім як користувачів додатку. Видалення облікового запису
          дорослого користувача та прив'язаних до цього облікового запису
          дітей-користувачів. Ви можете видалити свій обліковий запис та/або
          зв'язок з дітьми, прив'язаними до вашого облікового запису. Видалення
          вашого облікового запису назавжди видаляє ідентифікаційну інформацію,
          а також видаляє всі зв'язки з дітьми, прив'язаними до вашого
          облікового запису. Зміни до цієї Політики конфіденційності Час від
          часу ми будемо оновлювати цю політику конфіденційності. Ми завжди
          вказуємо дату опублікування останніх змін, і якщо зміни значні, ми
          надамо більш помітне сповіщення, наприклад, надіславши вам електронний
          лист. Зв'яжіться з нами Пишіть нам на адресу privacy@safekid.com з
          будь-якими запитаннями щодо цієї політики конфіденційності або того,
          як ми обробляємо вашу інформацію. Ми будемо раді допомогти.
        </IntroductionText>
      </WrapperText>
    </>
  );
};

export default PrivacyPolicy;
